Archive/app/controllers/api/users_controller.rb

INSERT INTO "users" ("password_digest") VALUES ($1) RETURNING "id"  [["password_digest", "$2a$12$FBB.GLZrzDeG0KJvpsbKOOUwV4SEWY4IU9Sy0IH8f9nnVJkGjiKQm"]]
---
  def create
    user = User.create(user_params)